{
    "title": "Day 19: Not Enough Minerals",
    "easter_eggs": [
        "If You Give A Mouse An Ore-Collecting Robot"
    ],
    "test_input_idx": 0,
    "part_1": {
        "text": "Your scans show that the lava did indeed form obsidian!\n\nThe wind has changed direction enough to stop sending lava droplets toward you, so you and the elephants exit the cave.\nAs you do, you notice a collection of geodes around the pond.\nPerhaps you could use the obsidian to create some geode-cracking robots and break them open?\n\nTo collect the obsidian from the bottom of the pond, you'll need waterproof obsidian-collecting robots.\nFortunately, there is an abundant amount of clay nearby that you can use to make them waterproof.\n\nIn order to harvest the clay, you'll need special-purpose clay-collecting robots.\nTo make any type of robot, you'll need ore, which is also plentiful but in the opposite direction from the clay.\n\nCollecting ore requires ore-collecting robots with big drills.\nFortunately, you have exactly one ore-collecting robot in your pack that you can use to kickstart the whole operation.\n\nEach robot can collect 1 of its resource type per minute.\nIt also takes one minute for the robot factory (also conveniently from your pack) to construct any type of robot, although it consumes the necessary resources available when construction begins.\n\nThe robot factory has many blueprints (your puzzle input) you can choose from, but once you've configured it with a blueprint, you can't change it.\nYou'll need to work out which blueprint is best.\n\nFor example:\n\nBlueprint 1:\n  Each ore robot costs 4 ore.\n  Each clay robot costs 2 ore.\n  Each obsidian robot costs 3 ore and 14 clay.\n  Each geode robot costs 2 ore and 7 obsidian.\n\nBlueprint 2:\n  Each ore robot costs 2 ore.\n  Each clay robot costs 3 ore.\n  Each obsidian robot costs 3 ore and 8 clay.\n  Each geode robot costs 3 ore and 12 obsidian.\n\n(Blueprints have been line-wrapped here for legibility.\nThe robot factory's actual assortment of blueprints are provided one blueprint per line.)\n\nThe elephants are starting to look hungry, so you shouldn't take too long; you need to figure out which blueprint would maximize the number of opened geodes after 24 minutes by figuring out which robots to build and when to build them.\n\nUsing blueprint 1 in the example above, the largest number of geodes you could open in 24 minutes is 9.\nOne way to achieve that is:\n\n== Minute 1 ==\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\n\n== Minute 2 ==\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n\n== Minute 3 ==\nSpend 2 ore to start building a clay-collecting robot.\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\nThe new clay-collecting robot is ready; you now have 1 of them.\n\n== Minute 4 ==\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n1 clay-collecting robot collects 1 clay; you now have 1 clay.\n\n== Minute 5 ==\nSpend 2 ore to start building a clay-collecting robot.\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\n1 clay-collecting robot collects 1 clay; you now have 2 clay.\nThe new clay-collecting robot is ready; you now have 2 of them.\n\n== Minute 6 ==\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n2 clay-collecting robots collect 2 clay; you now have 4 clay.\n\n== Minute 7 ==\nSpend 2 ore to start building a clay-collecting robot.\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\n2 clay-collecting robots collect 2 clay; you now have 6 clay.\nThe new clay-collecting robot is ready; you now have 3 of them.\n\n== Minute 8 ==\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n3 clay-collecting robots collect 3 clay; you now have 9 clay.\n\n== Minute 9 ==\n1 ore-collecting robot collects 1 ore; you now have 3 ore.\n3 clay-collecting robots collect 3 clay; you now have 12 clay.\n\n== Minute 10 ==\n1 ore-collecting robot collects 1 ore; you now have 4 ore.\n3 clay-collecting robots collect 3 clay; you now have 15 clay.\n\n== Minute 11 ==\nSpend 3 ore and 14 clay to start building an obsidian-collecting robot.\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n3 clay-collecting robots collect 3 clay; you now have 4 clay.\nThe new obsidian-collecting robot is ready; you now have 1 of them.\n\n== Minute 12 ==\nSpend 2 ore to start building a clay-collecting robot.\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\n3 clay-collecting robots collect 3 clay; you now have 7 clay.\n1 obsidian-collecting robot collects 1 obsidian; you now have 1 obsidian.\nThe new clay-collecting robot is ready; you now have 4 of them.\n\n== Minute 13 ==\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n4 clay-collecting robots collect 4 clay; you now have 11 clay.\n1 obsidian-collecting robot collects 1 obsidian; you now have 2 obsidian.\n\n== Minute 14 ==\n1 ore-collecting robot collects 1 ore; you now have 3 ore.\n4 clay-collecting robots collect 4 clay; you now have 15 clay.\n1 obsidian-collecting robot collects 1 obsidian; you now have 3 obsidian.\n\n== Minute 15 ==\nSpend 3 ore and 14 clay to start building an obsidian-collecting robot.\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\n4 clay-collecting robots collect 4 clay; you now have 5 clay.\n1 obsidian-collecting robot collects 1 obsidian; you now have 4 obsidian.\nThe new obsidian-collecting robot is ready; you now have 2 of them.\n\n== Minute 16 ==\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n4 clay-collecting robots collect 4 clay; you now have 9 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 6 obsidian.\n\n== Minute 17 ==\n1 ore-collecting robot collects 1 ore; you now have 3 ore.\n4 clay-collecting robots collect 4 clay; you now have 13 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 8 obsidian.\n\n== Minute 18 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n4 clay-collecting robots collect 4 clay; you now have 17 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 3 obsidian.\nThe new geode-cracking robot is ready; you now have 1 of them.\n\n== Minute 19 ==\n1 ore-collecting robot collects 1 ore; you now have 3 ore.\n4 clay-collecting robots collect 4 clay; you now have 21 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 5 obsidian.\n1 geode-cracking robot cracks 1 geode; you now have 1 open geode.\n\n== Minute 20 ==\n1 ore-collecting robot collects 1 ore; you now have 4 ore.\n4 clay-collecting robots collect 4 clay; you now have 25 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 7 obsidian.\n1 geode-cracking robot cracks 1 geode; you now have 2 open geodes.\n\n== Minute 21 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n1 ore-collecting robot collects 1 ore; you now have 3 ore.\n4 clay-collecting robots collect 4 clay; you now have 29 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 2 obsidian.\n1 geode-cracking robot cracks 1 geode; you now have 3 open geodes.\nThe new geode-cracking robot is ready; you now have 2 of them.\n\n== Minute 22 ==\n1 ore-collecting robot collects 1 ore; you now have 4 ore.\n4 clay-collecting robots collect 4 clay; you now have 33 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 4 obsidian.\n2 geode-cracking robots crack 2 geodes; you now have 5 open geodes.\n\n== Minute 23 ==\n1 ore-collecting robot collects 1 ore; you now have 5 ore.\n4 clay-collecting robots collect 4 clay; you now have 37 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 6 obsidian.\n2 geode-cracking robots crack 2 geodes; you now have 7 open geodes.\n\n== Minute 24 ==\n1 ore-collecting robot collects 1 ore; you now have 6 ore.\n4 clay-collecting robots collect 4 clay; you now have 41 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 8 obsidian.\n2 geode-cracking robots crack 2 geodes; you now have 9 open geodes.\n\nHowever, by using blueprint 2 in the example above, you could do even better: the largest number of geodes you could open in 24 minutes is 12.\n\nDetermine the quality level of each blueprint by multiplying that blueprint's ID number with the largest number of geodes that can be opened in 24 minutes using that blueprint.\nIn this example, the first blueprint has ID 1 and can open 9 geodes, so its quality level is 9.\nThe second blueprint has ID 2 and can open 12 geodes, so its quality level is 24.\nFinally, if you add up the quality levels of all of the blueprints in the list, you get 33.\n\nDetermine the quality level of each blueprint using the largest number of geodes it could produce in 24 minutes.\nWhat do you get if you add up the quality level of all of the blueprints in your list?",
        "test_input": "Blueprint 1:\n  Each ore robot costs 4 ore.\n  Each clay robot costs 2 ore.\n  Each obsidian robot costs 3 ore and 14 clay.\n  Each geode robot costs 2 ore and 7 obsidian.\n\nBlueprint 2:\n  Each ore robot costs 2 ore.\n  Each clay robot costs 3 ore.\n  Each obsidian robot costs 3 ore and 8 clay.\n  Each geode robot costs 3 ore and 12 obsidian.\n",
        "test_answer": 33,
        "test_answer_idx": -1,
        "answer": "988",
        "time": 4.089295199955814
    },
    "part_2": {
        "text": "While you were choosing the best blueprint, the elephants found some food on their own, so you're not in as much of a hurry; you figure you probably have 32 minutes before the wind changes direction again and you'll need to get out of range of the erupting volcano.\n\nUnfortunately, one of the elephants ate most of your blueprint list! Now, only the first three blueprints in your list are intact.\n\nIn 32 minutes, the largest number of geodes blueprint 1 (from the example above) can open is 56.\nOne way to achieve that is:\n\n== Minute 1 ==\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\n\n== Minute 2 ==\n1 ore-collecting robot collects 1 ore; you now have 2 ore.\n\n== Minute 3 ==\n1 ore-collecting robot collects 1 ore; you now have 3 ore.\n\n== Minute 4 ==\n1 ore-collecting robot collects 1 ore; you now have 4 ore.\n\n== Minute 5 ==\nSpend 4 ore to start building an ore-collecting robot.\n1 ore-collecting robot collects 1 ore; you now have 1 ore.\nThe new ore-collecting robot is ready; you now have 2 of them.\n\n== Minute 6 ==\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n\n== Minute 7 ==\nSpend 2 ore to start building a clay-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\nThe new clay-collecting robot is ready; you now have 1 of them.\n\n== Minute 8 ==\nSpend 2 ore to start building a clay-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n1 clay-collecting robot collects 1 clay; you now have 1 clay.\nThe new clay-collecting robot is ready; you now have 2 of them.\n\n== Minute 9 ==\nSpend 2 ore to start building a clay-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n2 clay-collecting robots collect 2 clay; you now have 3 clay.\nThe new clay-collecting robot is ready; you now have 3 of them.\n\n== Minute 10 ==\nSpend 2 ore to start building a clay-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n3 clay-collecting robots collect 3 clay; you now have 6 clay.\nThe new clay-collecting robot is ready; you now have 4 of them.\n\n== Minute 11 ==\nSpend 2 ore to start building a clay-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n4 clay-collecting robots collect 4 clay; you now have 10 clay.\nThe new clay-collecting robot is ready; you now have 5 of them.\n\n== Minute 12 ==\nSpend 2 ore to start building a clay-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n5 clay-collecting robots collect 5 clay; you now have 15 clay.\nThe new clay-collecting robot is ready; you now have 6 of them.\n\n== Minute 13 ==\nSpend 2 ore to start building a clay-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n6 clay-collecting robots collect 6 clay; you now have 21 clay.\nThe new clay-collecting robot is ready; you now have 7 of them.\n\n== Minute 14 ==\nSpend 3 ore and 14 clay to start building an obsidian-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 2 ore.\n7 clay-collecting robots collect 7 clay; you now have 14 clay.\nThe new obsidian-collecting robot is ready; you now have 1 of them.\n\n== Minute 15 ==\n2 ore-collecting robots collect 2 ore; you now have 4 ore.\n7 clay-collecting robots collect 7 clay; you now have 21 clay.\n1 obsidian-collecting robot collects 1 obsidian; you now have 1 obsidian.\n\n== Minute 16 ==\nSpend 3 ore and 14 clay to start building an obsidian-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n7 clay-collecting robots collect 7 clay; you now have 14 clay.\n1 obsidian-collecting robot collects 1 obsidian; you now have 2 obsidian.\nThe new obsidian-collecting robot is ready; you now have 2 of them.\n\n== Minute 17 ==\nSpend 3 ore and 14 clay to start building an obsidian-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 2 ore.\n7 clay-collecting robots collect 7 clay; you now have 7 clay.\n2 obsidian-collecting robots collect 2 obsidian; you now have 4 obsidian.\nThe new obsidian-collecting robot is ready; you now have 3 of them.\n\n== Minute 18 ==\n2 ore-collecting robots collect 2 ore; you now have 4 ore.\n7 clay-collecting robots collect 7 clay; you now have 14 clay.\n3 obsidian-collecting robots collect 3 obsidian; you now have 7 obsidian.\n\n== Minute 19 ==\nSpend 3 ore and 14 clay to start building an obsidian-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n7 clay-collecting robots collect 7 clay; you now have 7 clay.\n3 obsidian-collecting robots collect 3 obsidian; you now have 10 obsidian.\nThe new obsidian-collecting robot is ready; you now have 4 of them.\n\n== Minute 20 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 3 ore.\n7 clay-collecting robots collect 7 clay; you now have 14 clay.\n4 obsidian-collecting robots collect 4 obsidian; you now have 7 obsidian.\nThe new geode-cracking robot is ready; you now have 1 of them.\n\n== Minute 21 ==\nSpend 3 ore and 14 clay to start building an obsidian-collecting robot.\n2 ore-collecting robots collect 2 ore; you now have 2 ore.\n7 clay-collecting robots collect 7 clay; you now have 7 clay.\n4 obsidian-collecting robots collect 4 obsidian; you now have 11 obsidian.\n1 geode-cracking robot cracks 1 geode; you now have 1 open geode.\nThe new obsidian-collecting robot is ready; you now have 5 of them.\n\n== Minute 22 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 2 ore.\n7 clay-collecting robots collect 7 clay; you now have 14 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 9 obsidian.\n1 geode-cracking robot cracks 1 geode; you now have 2 open geodes.\nThe new geode-cracking robot is ready; you now have 2 of them.\n\n== Minute 23 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 2 ore.\n7 clay-collecting robots collect 7 clay; you now have 21 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 7 obsidian.\n2 geode-cracking robots crack 2 geodes; you now have 4 open geodes.\nThe new geode-cracking robot is ready; you now have 3 of them.\n\n== Minute 24 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 2 ore.\n7 clay-collecting robots collect 7 clay; you now have 28 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 5 obsidian.\n3 geode-cracking robots crack 3 geodes; you now have 7 open geodes.\nThe new geode-cracking robot is ready; you now have 4 of them.\n\n== Minute 25 ==\n2 ore-collecting robots collect 2 ore; you now have 4 ore.\n7 clay-collecting robots collect 7 clay; you now have 35 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 10 obsidian.\n4 geode-cracking robots crack 4 geodes; you now have 11 open geodes.\n\n== Minute 26 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 4 ore.\n7 clay-collecting robots collect 7 clay; you now have 42 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 8 obsidian.\n4 geode-cracking robots crack 4 geodes; you now have 15 open geodes.\nThe new geode-cracking robot is ready; you now have 5 of them.\n\n== Minute 27 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 4 ore.\n7 clay-collecting robots collect 7 clay; you now have 49 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 6 obsidian.\n5 geode-cracking robots crack 5 geodes; you now have 20 open geodes.\nThe new geode-cracking robot is ready; you now have 6 of them.\n\n== Minute 28 ==\n2 ore-collecting robots collect 2 ore; you now have 6 ore.\n7 clay-collecting robots collect 7 clay; you now have 56 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 11 obsidian.\n6 geode-cracking robots crack 6 geodes; you now have 26 open geodes.\n\n== Minute 29 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 6 ore.\n7 clay-collecting robots collect 7 clay; you now have 63 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 9 obsidian.\n6 geode-cracking robots crack 6 geodes; you now have 32 open geodes.\nThe new geode-cracking robot is ready; you now have 7 of them.\n\n== Minute 30 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 6 ore.\n7 clay-collecting robots collect 7 clay; you now have 70 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 7 obsidian.\n7 geode-cracking robots crack 7 geodes; you now have 39 open geodes.\nThe new geode-cracking robot is ready; you now have 8 of them.\n\n== Minute 31 ==\nSpend 2 ore and 7 obsidian to start building a geode-cracking robot.\n2 ore-collecting robots collect 2 ore; you now have 6 ore.\n7 clay-collecting robots collect 7 clay; you now have 77 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 5 obsidian.\n8 geode-cracking robots crack 8 geodes; you now have 47 open geodes.\nThe new geode-cracking robot is ready; you now have 9 of them.\n\n== Minute 32 ==\n2 ore-collecting robots collect 2 ore; you now have 8 ore.\n7 clay-collecting robots collect 7 clay; you now have 84 clay.\n5 obsidian-collecting robots collect 5 obsidian; you now have 10 obsidian.\n9 geode-cracking robots crack 9 geodes; you now have 56 open geodes.\n\nHowever, blueprint 2 from the example above is still better; using it, the largest number of geodes you could open in 32 minutes is 62.\n\nYou no longer have enough blueprints to worry about quality levels.\nInstead, for each of the first three blueprints, determine the largest number of geodes you could open; then, multiply these three values together.\n\nDon't worry about quality levels; instead, just determine the largest number of geodes you could open using each of the first three blueprints.\nWhat do you get if you multiply these numbers together?",
        "test_input": "Blueprint 1:\n  Each ore robot costs 4 ore.\n  Each clay robot costs 2 ore.\n  Each obsidian robot costs 3 ore and 14 clay.\n  Each geode robot costs 2 ore and 7 obsidian.\n\nBlueprint 2:\n  Each ore robot costs 2 ore.\n  Each clay robot costs 3 ore.\n  Each obsidian robot costs 3 ore and 8 clay.\n  Each geode robot costs 3 ore and 12 obsidian.\n",
        "test_answer": 62,
        "test_answer_idx": -1,
        "answer": "8580",
        "time": 17.953529499995057
    }
}
