{
    "title": "Day 24: Blizzard Basin",
    "easter_eggs": [
        "I think, anyway. Do I look like a theoretical blizzacist?"
    ],
    "test_input_idx": -2,
    "part_1": {
        "text": "With everything replanted for next year (and with elephants and monkeys to tend the grove), you and the Elves leave for the extraction point.\n\nPartway up the mountain that shields the grove is a flat, open area that serves as the extraction point.\nIt's a bit of a climb, but nothing the expedition can't handle.\n\nAt least, that would normally be true; now that the mountain is covered in snow, things have become more difficult than the Elves are used to.\n\nAs the expedition reaches a valley that must be traversed to reach the extraction site, you find that strong, turbulent winds are pushing small blizzards of snow and sharp ice around the valley.\nIt's a good thing everyone packed warm clothes! To make it across safely, you'll need to find a way to avoid them.\n\nFortunately, it's easy to see all of this from the entrance to the valley, so you make a map of the valley and the blizzards (your puzzle input).\nFor example:\n\n#.#####\n#.....#\n#>....#\n#.....#\n#...v.#\n#.....#\n#####.#\n\nThe walls of the valley are drawn as #; everything else is ground.\nClear ground - where there is currently no blizzard - is drawn as ..\nOtherwise, blizzards are drawn with an arrow indicating their direction of motion: up (^), down (v), left (<), or right (>).\n\nThe above map includes two blizzards, one moving right (>) and one moving down (v).\nIn one minute, each blizzard moves one position in the direction it is pointing:\n\n#.#####\n#.....#\n#.>...#\n#.....#\n#.....#\n#...v.#\n#####.#\n\nDue to conservation of blizzard energy, as a blizzard reaches the wall of the valley, a new blizzard forms on the opposite side of the valley moving in the same direction.\nAfter another minute, the bottom downward-moving blizzard has been replaced with a new downward-moving blizzard at the top of the valley instead:\n\n#.#####\n#...v.#\n#..>..#\n#.....#\n#.....#\n#.....#\n#####.#\n\nBecause blizzards are made of tiny snowflakes, they pass right through each other.\nAfter another minute, both blizzards temporarily occupy the same position, marked 2:\n\n#.#####\n#.....#\n#...2.#\n#.....#\n#.....#\n#.....#\n#####.#\n\nAfter another minute, the situation resolves itself, giving each blizzard back its personal space:\n\n#.#####\n#.....#\n#....>#\n#...v.#\n#.....#\n#.....#\n#####.#\n\nFinally, after yet another minute, the rightward-facing blizzard on the right is replaced with a new one on the left facing the same direction:\n\n#.#####\n#.....#\n#>....#\n#.....#\n#...v.#\n#.....#\n#####.#\n\nThis process repeats at least as long as you are observing it, but probably forever.\n\nHere is a more complex example:\n\n#.######\n#>>.<^<#\n#.<..<<#\n#>v.><>#\n#<^v^^>#\n######.#\n\nYour expedition begins in the only non-wall position in the top row and needs to reach the only non-wall position in the bottom row.\nOn each minute, you can move up, down, left, or right, or you can wait in place.\nYou and the blizzards act simultaneously, and you cannot share a position with a blizzard.\n\nIn the above example, the fastest way to reach your goal requires 18 steps.\nDrawing the position of the expedition as E, one way to achieve this is:\n\nInitial state:\n#E######\n#>>.<^<#\n#.<..<<#\n#>v.><>#\n#<^v^^>#\n######.#\n\nMinute 1, move down:\n#.######\n#E>3.<.#\n#<..<<.#\n#>2.22.#\n#>v..^<#\n######.#\n\nMinute 2, move down:\n#.######\n#.2>2..#\n#E^22^<#\n#.>2.^>#\n#.>..<.#\n######.#\n\nMinute 3, wait:\n#.######\n#<^<22.#\n#E2<.2.#\n#><2>..#\n#..><..#\n######.#\n\nMinute 4, move up:\n#.######\n#E<..22#\n#<<.<..#\n#<2.>>.#\n#.^22^.#\n######.#\n\nMinute 5, move right:\n#.######\n#2Ev.<>#\n#<.<..<#\n#.^>^22#\n#.2..2.#\n######.#\n\nMinute 6, move right:\n#.######\n#>2E<.<#\n#.2v^2<#\n#>..>2>#\n#<....>#\n######.#\n\nMinute 7, move down:\n#.######\n#.22^2.#\n#<vE<2.#\n#>>v<>.#\n#>....<#\n######.#\n\nMinute 8, move left:\n#.######\n#.<>2^.#\n#.E<<.<#\n#.22..>#\n#.2v^2.#\n######.#\n\nMinute 9, move up:\n#.######\n#<E2>>.#\n#.<<.<.#\n#>2>2^.#\n#.v><^.#\n######.#\n\nMinute 10, move right:\n#.######\n#.2E.>2#\n#<2v2^.#\n#<>.>2.#\n#..<>..#\n######.#\n\nMinute 11, wait:\n#.######\n#2^E^2>#\n#<v<.^<#\n#..2.>2#\n#.<..>.#\n######.#\n\nMinute 12, move down:\n#.######\n#>>.<^<#\n#.<E.<<#\n#>v.><>#\n#<^v^^>#\n######.#\n\nMinute 13, move down:\n#.######\n#.>3.<.#\n#<..<<.#\n#>2E22.#\n#>v..^<#\n######.#\n\nMinute 14, move right:\n#.######\n#.2>2..#\n#.^22^<#\n#.>2E^>#\n#.>..<.#\n######.#\n\nMinute 15, move right:\n#.######\n#<^<22.#\n#.2<.2.#\n#><2>E.#\n#..><..#\n######.#\n\nMinute 16, move right:\n#.######\n#.<..22#\n#<<.<..#\n#<2.>>E#\n#.^22^.#\n######.#\n\nMinute 17, move down:\n#.######\n#2.v.<>#\n#<.<..<#\n#.^>^22#\n#.2..2E#\n######.#\n\nMinute 18, move down:\n#.######\n#>2.<.<#\n#.2v^2<#\n#>..>2>#\n#<....>#\n######E#\n\nWhat is the fewest number of minutes required to avoid the blizzards and reach the goal?",
        "test_input": "#.######\n#>>.<^<#\n#.<..<<#\n#>v.><>#\n#<^v^^>#\n######.#\n",
        "test_answer": 18,
        "test_answer_idx": -3,
        "answer": "292"
    },
    "part_2": {
        "text": "As the expedition reaches the far side of the valley, one of the Elves looks especially dismayed:\n\nHe forgot his snacks at the entrance to the valley!\n\nSince you're so good at dodging blizzards, the Elves humbly request that you go back for his snacks.\nFrom the same initial conditions, how quickly can you make it from the start to the goal, then back to the start, then back to the goal?\n\nIn the above example, the first trip to the goal takes 18 minutes, the trip back to the start takes 23 minutes, and the trip back to the goal again takes 13 minutes, for a total time of 54 minutes.\n\nWhat is the fewest number of minutes required to reach the goal, go back to the start, then reach the goal again?",
        "test_input": "#.######\n#>>.<^<#\n#.<..<<#\n#>v.><>#\n#<^v^^>#\n######.#\n",
        "test_answer": 54,
        "test_answer_idx": -1,
        "answer": "816"
    }
}
