{
    "title": "Day 3: Gear Ratios",
    "easter_eggs": [
        "They're magic gears."
    ],
    "test_input_idx": 0,
    "part_1": {
        "text": "You and the Elf eventually reach a gondola lift station; he says the gondola lift will take you up to the water source, but this is as far as he can bring you.\nYou go inside.\n\nIt doesn't take long to find the gondolas, but there seems to be a problem: they're not moving.\n\n\"Aaah!\"\n\nYou turn around to see a slightly-greasy Elf with a wrench and a look of surprise.\n\"Sorry, I wasn't expecting anyone! The gondola lift isn't working right now; it'll still be a while before I can fix it.\" You offer to help.\n\nThe engineer explains that an engine part seems to be missing from the engine, but nobody can figure out which one.\nIf you can add up all the part numbers in the engine schematic, it should be easy to work out which part is missing.\n\nThe engine schematic (your puzzle input) consists of a visual representation of the engine.\nThere are lots of numbers and symbols you don't really understand, but apparently any number adjacent to a symbol, even diagonally, is a \"part number\" and should be included in your sum.\n(Periods (.) do not count as a symbol.)\n\nHere is an example engine schematic:\n\n467..114..\n...*......\n..35..633.\n......#...\n617*......\n.....+.58.\n..592.....\n......755.\n...$.*....\n.664.598..\n\nIn this schematic, two numbers are not part numbers because they are not adjacent to a symbol: 114 (top right) and 58 (middle right).\nEvery other number is adjacent to a symbol and so is a part number; their sum is 4361.\n\nOf course, the actual engine schematic is much larger.\nWhat is the sum of all of the part numbers in the engine schematic?",
        "test_input": "467..114..\n...*......\n..35..633.\n......#...\n617*......\n.....+.58.\n..592.....\n......755.\n...$.*....\n.664.598..\n",
        "test_answer": 4361,
        "test_answer_idx": -1,
        "answer": "530849"
    },
    "part_2": {
        "text": "The engineer finds the missing part and installs it in the engine! As the engine springs to life, you jump in the closest gondola, finally ready to ascend to the water source.\n\nYou don't seem to be going very fast, though.\nMaybe something is still wrong? Fortunately, the gondola has a phone labeled \"help\", so you pick it up and the engineer answers.\n\nBefore you can explain the situation, she suggests that you look out the window.\nThere stands the engineer, holding a phone in one hand and waving with the other.\nYou're going so slowly that you haven't even left the station.\nYou exit the gondola.\n\nThe missing part wasn't the only issue - one of the gears in the engine is wrong.\nA gear is any * symbol that is adjacent to exactly two part numbers.\nIts gear ratio is the result of multiplying those two numbers together.\n\nThis time, you need to find the gear ratio of every gear and add them all up so that the engineer can figure out which gear needs to be replaced.\n\nConsider the same engine schematic again:\n\n467..114..\n...*......\n..35..633.\n......#...\n617*......\n.....+.58.\n..592.....\n......755.\n...$.*....\n.664.598..\n\nIn this schematic, there are two gears.\nThe first is in the top left; it has part numbers 467 and 35, so its gear ratio is 16345.\nThe second gear is in the lower right; its gear ratio is 451490.\n(The * adjacent to 617 is not a gear because it is only adjacent to one part number.) Adding up all of the gear ratios produces 467835.\n\nWhat is the sum of all of the gear ratios in your engine schematic?",
        "test_input": "467..114..\n...*......\n..35..633.\n......#...\n617*......\n.....+.58.\n..592.....\n......755.\n...$.*....\n.664.598..\n",
        "test_answer": 467835,
        "test_answer_idx": -1,
        "answer": "84900879"
    }
}
