{
    "title": "Day 15: Lens Library",
    "easter_eggs": [
        "do you like my hard hat"
    ],
    "test_input_idx": 0,
    "part_1": {
        "text": "The newly-focused parabolic reflector dish is sending all of the collected light to a point on the side of yet another mountain - the largest mountain on Lava Island.\nAs you approach the mountain, you find that the light is being collected by the wall of a large facility embedded in the mountainside.\n\nYou find a door under a large sign that says \"Lava Production Facility\" and next to a smaller sign that says \"Danger - Personal Protective Equipment required beyond this point\".\n\nAs you step inside, you are immediately greeted by a somewhat panicked reindeer wearing goggles and a loose-fitting hard hat.\nThe reindeer leads you to a shelf of goggles and hard hats (you quickly find some that fit) and then further into the facility.\nAt one point, you pass a button with a faint snout mark and the label \"PUSH FOR HELP\".\nNo wonder you were loaded into that trebuchet so quickly!\n\nYou pass through a final set of doors surrounded with even more warning signs and into what must be the room that collects all of the light from outside.\nAs you admire the large assortment of lenses available to further focus the light, the reindeer brings you a book titled \"Initialization Manual\".\n\n\"Hello!\", the book cheerfully begins, apparently unaware of the concerned reindeer reading over your shoulder.\n\"This procedure will let you bring the Lava Production Facility online - all without burning or melting anything unintended!\"\n\n\"Before you begin, please be prepared to use the Holiday ASCII String Helper algorithm (appendix 1A).\" You turn to appendix 1A.\nThe reindeer leans closer with interest.\n\nThe HASH algorithm is a way to turn any string of characters into a single number in the range 0 to 255.\nTo run the HASH algorithm on a string, start with a current value of 0.\nThen, for each character in the string starting from the beginning:\n\nDetermine the ASCII code for the current character of the string.\nIncrease the current value by the ASCII code you just determined.\nSet the current value to itself multiplied by 17.\nSet the current value to the remainder of dividing itself by 256.\n\nAfter following these steps for each character in the string in order, the current value is the output of the HASH algorithm.\n\nSo, to find the result of running the HASH algorithm on the string HASH:\n\nThe current value starts at 0.\nThe first character is H; its ASCII code is 72.\nThe current value increases to 72.\nThe current value is multiplied by 17 to become 1224.\nThe current value becomes 200 (the remainder of 1224 divided by 256).\nThe next character is A; its ASCII code is 65.\nThe current value increases to 265.\nThe current value is multiplied by 17 to become 4505.\nThe current value becomes 153 (the remainder of 4505 divided by 256).\nThe next character is S; its ASCII code is 83.\nThe current value increases to 236.\nThe current value is multiplied by 17 to become 4012.\nThe current value becomes 172 (the remainder of 4012 divided by 256).\nThe next character is H; its ASCII code is 72.\nThe current value increases to 244.\nThe current value is multiplied by 17 to become 4148.\nThe current value becomes 52 (the remainder of 4148 divided by 256).\n\nSo, the result of running the HASH algorithm on the string HASH is 52.\n\nThe initialization sequence (your puzzle input) is a comma-separated list of steps to start the Lava Production Facility.\nIgnore newline characters when parsing the initialization sequence.\nTo verify that your HASH algorithm is working, the book offers the sum of the result of running the HASH algorithm on each step in the initialization sequence.\n\nFor example:\n\nrn=1,cm-,qp=3,cm=2,qp-,pc=4,ot=9,ab=5,pc-,pc=6,ot=7\n\nThis initialization sequence specifies 11 individual steps; the result of running the HASH algorithm on each of the steps is as follows:\n\nrn=1 becomes 30.\ncm- becomes 253.\nqp=3 becomes 97.\ncm=2 becomes 47.\nqp- becomes 14.\npc=4 becomes 180.\not=9 becomes 9.\nab=5 becomes 197.\npc- becomes 48.\npc=6 becomes 214.\not=7 becomes 231.\n\nIn this example, the sum of these results is 1320.\nUnfortunately, the reindeer has stolen the page containing the expected verification number and is currently running around the facility with it excitedly.\n\nRun the HASH algorithm on each step in the initialization sequence.\nWhat is the sum of the results? (The initialization sequence is one long line; be careful when copy-pasting it.)",
        "test_input": "rn=1,cm-,qp=3,cm=2,qp-,pc=4,ot=9,ab=5,pc-,pc=6,ot=7",
        "test_answer": 1320,
        "test_answer_idx": -1,
        "answer": "506437",
        "time": 0.003826599999683822
    },
    "part_2": {
        "text": "You convince the reindeer to bring you the page; the page confirms that your HASH algorithm is working.\n\nThe book goes on to describe a series of 256 boxes numbered 0 through 255.\nThe boxes are arranged in a line starting from the point where light enters the facility.\nThe boxes have holes that allow light to pass from one box to the next all the way down the line.\n\n+-----+  +-----+         +-----+\nLight | Box |  | Box |   ...\n  | Box |\n----------------------------------------->\n      |  0  |  |  1  |   ...\n  | 255 |\n      +-----+  +-----+         +-----+\n\nInside each box, there are several lens slots that will keep a lens correctly positioned to focus light passing through the box.\nThe side of each box has a panel that opens to allow you to insert or remove lenses as necessary.\n\nAlong the wall running parallel to the boxes is a large library containing lenses organized by focal length ranging from 1 through 9.\nThe reindeer also brings you a small handheld label printer.\n\nThe book goes on to explain how to perform each step in the initialization sequence, a process it calls the Holiday ASCII String Helper Manual Arrangement Procedure, or HASHMAP for short.\n\nEach step begins with a sequence of letters that indicate the label of the lens on which the step operates.\nThe result of running the HASH algorithm on the label indicates the correct box for that step.\n\nThe label will be immediately followed by a character that indicates the operation to perform: either an equals sign (=) or a dash (-).\n\nIf the operation character is a dash (-), go to the relevant box and remove the lens with the given label if it is present in the box.\nThen, move any remaining lenses as far forward in the box as they can go without changing their order, filling any space made by removing the indicated lens.\n(If no lens in that box has the given label, nothing happens.)\n\nIf the operation character is an equals sign (=), it will be followed by a number indicating the focal length of the lens that needs to go into the relevant box; be sure to use the label maker to mark the lens with the label given in the beginning of the step so you can find it later.\nThere are two possible situations:\n\nIf there is already a lens in the box with the same label, replace the old lens with the new lens: remove the old lens and put the new lens in its place, not moving any other lenses in the box.\nIf there is not already a lens in the box with the same label, add the lens to the box immediately behind any lenses already in the box.\nDon't move any of the other lenses when you do this.\nIf there aren't any lenses in the box, the new lens goes all the way to the front of the box.\n\nHere is the contents of every box after each step in the example initialization sequence above:\n\nAfter \"rn=1\":\nBox 0: [rn 1]\n\nAfter \"cm-\":\nBox 0: [rn 1]\n\nAfter \"qp=3\":\nBox 0: [rn 1]\nBox 1: [qp 3]\n\nAfter \"cm=2\":\nBox 0: [rn 1] [cm 2]\nBox 1: [qp 3]\n\nAfter \"qp-\":\nBox 0: [rn 1] [cm 2]\n\nAfter \"pc=4\":\nBox 0: [rn 1] [cm 2]\nBox 3: [pc 4]\n\nAfter \"ot=9\":\nBox 0: [rn 1] [cm 2]\nBox 3: [pc 4] [ot 9]\n\nAfter \"ab=5\":\nBox 0: [rn 1] [cm 2]\nBox 3: [pc 4] [ot 9] [ab 5]\n\nAfter \"pc-\":\nBox 0: [rn 1] [cm 2]\nBox 3: [ot 9] [ab 5]\n\nAfter \"pc=6\":\nBox 0: [rn 1] [cm 2]\nBox 3: [ot 9] [ab 5] [pc 6]\n\nAfter \"ot=7\":\nBox 0: [rn 1] [cm 2]\nBox 3: [ot 7] [ab 5] [pc 6]\n\nAll 256 boxes are always present; only the boxes that contain any lenses are shown here.\nWithin each box, lenses are listed from front to back; each lens is shown as its label and focal length in square brackets.\n\nTo confirm that all of the lenses are installed correctly, add up the focusing power of all of the lenses.\nThe focusing power of a single lens is the result of multiplying together:\n\nOne plus the box number of the lens in question.\nThe slot number of the lens within the box: 1 for the first lens, 2 for the second lens, and so on.\nThe focal length of the lens.\n\nAt the end of the above example, the focusing power of each lens is as follows:\n\nrn: 1 (box 0) * 1 (first slot) * 1 (focal length) = 1\ncm: 1 (box 0) * 2 (second slot) * 2 (focal length) = 4\not: 4 (box 3) * 1 (first slot) * 7 (focal length) = 28\nab: 4 (box 3) * 2 (second slot) * 5 (focal length) = 40\npc: 4 (box 3) * 3 (third slot) * 6 (focal length) = 72\n\nSo, the above example ends up with a total focusing power of 145.\n\nWith the help of an over-enthusiastic reindeer in a hard hat, follow the initialization sequence.\nWhat is the focusing power of the resulting lens configuration?",
        "test_input": "rn=1,cm-,qp=3,cm=2,qp-,pc=4,ot=9,ab=5,pc-,pc=6,ot=7",
        "test_answer": 145,
        "test_answer_idx": -1,
        "answer": "288521",
        "time": 0.004717100000107166
    }
}
