{
    "title": "Day 14: Regolith Reservoir",
    "easter_eggs": [
        "Endless Void is my C cover band."
    ],
    "test_input_idx": 0,
    "part_1": {
        "text": "The distress signal leads you to a giant waterfall! Actually, hang on - the signal seems like it's coming from the waterfall itself, and that doesn't make any sense.\nHowever, you do notice a little path that leads behind the waterfall.\n\nCorrection: the distress signal leads you behind a giant waterfall! There seems to be a large cave system here, and the signal definitely leads further inside.\n\nAs you begin to make your way deeper underground, you feel the ground rumble for a moment.\nSand begins pouring into the cave! If you don't quickly figure out where the sand is going, you could quickly become trapped!\n\nFortunately, your familiarity with analyzing the path of falling material will come in handy here.\nYou scan a two-dimensional vertical slice of the cave above you (your puzzle input) and discover that it is mostly air with structures made of rock.\n\nYour scan traces the path of each solid rock structure and reports the x,y coordinates that form the shape of the path, where x represents distance to the right and y represents distance down.\nEach path appears as a single line of text in your scan.\nAfter the first point of each path, each point indicates the end of a straight horizontal or vertical line to be drawn from the previous point.\nFor example:\n\n498,4 -> 498,6 -> 496,6\n503,4 -> 502,4 -> 502,9 -> 494,9\n\nThis scan means that there are two paths of rock; the first path consists of two straight lines, and the second path consists of three straight lines.\n(Specifically, the first path consists of a line of rock from 498,4 through 498,6 and another line of rock from 498,6 through 496,6.)\n\nThe sand is pouring into the cave from point 500,0.\n\nDrawing rock as #, air as ., and the source of the sand as +, this becomes:\n\n4     5  5\n  9     0  0\n  4     0  3\n0 ......+...\n1 ..........\n2 ..........\n3 ..........\n4 ....#...##\n5 ....#...#.\n6 ..###...#.\n7 ........#.\n8 ........#.\n9 #########.\n\nSand is produced one unit at a time, and the next unit of sand is not produced until the previous unit of sand comes to rest.\nA unit of sand is large enough to fill one tile of air in your scan.\n\nA unit of sand always falls down one step if possible.\nIf the tile immediately below is blocked (by rock or sand), the unit of sand attempts to instead move diagonally one step down and to the left.\nIf that tile is blocked, the unit of sand attempts to instead move diagonally one step down and to the right.\nSand keeps moving as long as it is able to do so, at each step trying to move down, then down-left, then down-right.\nIf all three possible destinations are blocked, the unit of sand comes to rest and no longer moves, at which point the next unit of sand is created back at the source.\n\nSo, drawing sand that has come to rest as o, the first unit of sand simply falls straight down and then stops:\n\n......+...\n..........\n..........\n..........\n....#...##\n....#...#.\n..###...#.\n........#.\n......o.#.\n#########.\n\nThe second unit of sand then falls straight down, lands on the first one, and then comes to rest to its left:\n\n......+...\n..........\n..........\n..........\n....#...##\n....#...#.\n..###...#.\n........#.\n.....oo.#.\n#########.\n\nAfter a total of five units of sand have come to rest, they form this pattern:\n\n......+...\n..........\n..........\n..........\n....#...##\n....#...#.\n..###...#.\n......o.#.\n....oooo#.\n#########.\n\nAfter a total of 22 units of sand:\n\n......+...\n..........\n......o...\n.....ooo..\n....#ooo##\n....#ooo#.\n..###ooo#.\n....oooo#.\n...ooooo#.\n#########.\n\nFinally, only two more units of sand can possibly come to rest:\n\n......+...\n..........\n......o...\n.....ooo..\n....#ooo##\n...o#ooo#.\n..###ooo#.\n....oooo#.\n.o.ooooo#.\n#########.\n\nOnce all 24 units of sand shown above have come to rest, all further sand flows out the bottom, falling into the endless void.\nJust for fun, the path any new sand takes before falling forever is shown here with ~:\n\n.......+...\n.......~...\n......~o...\n.....~ooo..\n....~#ooo##\n...~o#ooo#.\n..~###ooo#.\n..~..oooo#.\n.~o.ooooo#.\n~#########.\n~..........\n~..........\n~..........\n\nUsing your scan, simulate the falling sand.\nHow many units of sand come to rest before sand starts flowing into the abyss below?",
        "test_input": "498,4 -> 498,6 -> 496,6\n503,4 -> 502,4 -> 502,9 -> 494,9\n",
        "test_answer": 24,
        "test_answer_idx": -3,
        "answer": "1330",
        "time": 11.125561499968171
    },
    "part_2": {
        "text": "You realize you misread the scan.\nThere isn't an endless void at the bottom of the scan - there's floor, and you're standing on it!\n\nYou don't have time to scan the floor, so assume the floor is an infinite horizontal line with a y coordinate equal to two plus the highest y coordinate of any point in your scan.\n\nIn the example above, the highest y coordinate of any point is 9, and so the floor is at y=11.\n(This is as if your scan contained one extra rock path like -infinity,11 -> infinity,11.) With the added floor, the example above now looks like this:\n\n...........+........\n        ....................\n        ....................\n        ....................\n        .........#...##.....\n        .........#...#......\n        .......###...#......\n        .............#......\n        .............#......\n        .....#########......\n        ....................\n<-- etc #################### etc -->\n\nTo find somewhere safe to stand, you'll need to simulate falling sand until a unit of sand comes to rest at 500,0, blocking the source entirely and stopping the flow of sand into the cave.\nIn the example above, the situation finally looks like this after 93 units of sand come to rest:\n\n............o............\n...........ooo...........\n..........ooooo..........\n.........ooooooo.........\n........oo#ooo##o........\n.......ooo#ooo#ooo.......\n......oo###ooo#oooo......\n.....oooo.oooo#ooooo.....\n....oooooooooo#oooooo....\n...ooo#########ooooooo...\n..ooooo.......ooooooooo..\n#########################\n\nUsing your scan, simulate the falling sand until the source of the sand becomes blocked.\nHow many units of sand come to rest?",
        "test_input": "498,4 -> 498,6 -> 496,6\n503,4 -> 502,4 -> 502,9 -> 494,9\n",
        "test_answer": 93,
        "test_answer_idx": -2,
        "answer": "26139",
        "time": 0.9465306997299194
    }
}
