{
    "title": "Day 13: Transparent Origami",
    "easter_eggs": [
        "How can you fold it that many times? You tell me, I'm not the one folding it."
    ],
    "test_input_idx": 1,
    "part_1": {
        "text": "You reach another volcanically active part of the cave.\nIt would be nice if you could do some kind of thermal imaging so you could tell ahead of time which caves are too hot to safely enter.\n\nFortunately, the submarine seems to be equipped with a thermal camera! When you activate it, you are greeted with:\n\nCongratulations on your purchase! To activate this infrared thermal imaging\ncamera system, please enter the code found on page 1 of the manual.\n\nApparently, the Elves have never used this feature.\nTo your surprise, you manage to find the manual; as you go to open it, page 1 falls out.\nIt's a large sheet of transparent paper! The transparent paper is marked with random dots and includes instructions on how to fold it up (your puzzle input).\nFor example:\n\n6,10\n0,14\n9,10\n0,3\n10,4\n4,11\n6,0\n6,12\n4,1\n0,13\n10,12\n3,4\n3,0\n8,4\n1,10\n2,14\n8,10\n9,0\n\nfold along y=7\nfold along x=5\n\nThe first section is a list of dots on the transparent paper.\n0,0 represents the top-left coordinate.\n The first value, x, increases to the right.\n The second value, y, increases downward.\n So, the coordinate 3,0 is to the right of 0,0, and the coordinate 0,7 is below 0,0.\nThe coordinates in this example form the following pattern, where # is a dot on the paper and .\nis an empty, unmarked position:\n\n...#..#..#.\n....#......\n...........\n#..........\n...#....#.#\n...........\n...........\n...........\n...........\n...........\n.#....#.##.\n....#......\n......#...#\n#..........\n#.#........\n\nThen, there is a list of fold instructions.\nEach instruction indicates a line on the transparent paper and wants you to fold the paper up (for horizontal y=...\nlines) or left (for vertical x=...\nlines).\nIn this example, the first fold instruction is fold along y=7, which designates the line formed by all of the positions where y is 7 (marked here with -):\n\n...#..#..#.\n....#......\n...........\n#..........\n...#....#.#\n...........\n...........\n-----------\n...........\n...........\n.#....#.##.\n....#......\n......#...#\n#..........\n#.#........\n\nBecause this is a horizontal line, fold the bottom half up.\nSome of the dots might end up overlapping after the fold is complete, but dots will never appear exactly on a fold line.\nThe result of doing this fold looks like this:\n\n#.##..#..#.\n#...#......\n......#...#\n#...#......\n.#.#..#.###\n...........\n...........\n\nNow, only 17 dots are visible.\n\nNotice, for example, the two dots in the bottom left corner before the transparent paper is folded; after the fold is complete, those dots appear in the top left corner (at 0,0 and 0,1).\nBecause the paper is transparent, the dot just below them in the result (at 0,3) remains visible, as it can be seen through the transparent paper.\n\nAlso notice that some dots can end up overlapping; in this case, the dots merge together and become a single dot.\n\nThe second fold instruction is fold along x=5, which indicates this line:\n\n#.##.|#..#.\n#...#|.....\n.....|#...#\n#...#|.....\n.#.#.|#.###\n.....|.....\n.....|.....\n\nBecause this is a vertical line, fold left:\n\n#####\n#...#\n#...#\n#...#\n#####\n.....\n.....\n\nThe instructions made a square!\n\nThe transparent paper is pretty big, so for now, focus on just completing the first fold.\nAfter the first fold in the example above, 17 dots are visible - dots that end up overlapping after the fold is completed count as a single dot.\n\nHow many dots are visible after completing just the first fold instruction on your transparent paper?",
        "test_input": "6,10\n0,14\n9,10\n0,3\n10,4\n4,11\n6,0\n6,12\n4,1\n0,13\n10,12\n3,4\n3,0\n8,4\n1,10\n2,14\n8,10\n9,0\n\nfold along y=7\nfold along x=5\n",
        "test_answer": 17,
        "test_answer_idx": -1,
        "answer": "708",
        "time": 0.0011643000007097726
    },
    "part_2": {
        "text": "Finish folding the transparent paper according to the instructions.\nThe manual says the code is always eight capital letters.\n\nWhat code do you use to activate the infrared thermal imaging camera system?",
        "test_input": "6,10\n0,14\n9,10\n0,3\n10,4\n4,11\n6,0\n6,12\n4,1\n0,13\n10,12\n3,4\n3,0\n8,4\n1,10\n2,14\n8,10\n9,0\n\nfold along y=7\nfold along x=5\n",
        "test_answer": null,
        "test_answer_idx": -1,
        "answer": "EBLUBRFH",
        "time": 0.003324799999973038
    }
}
