{
    "title": "Day 8: Seven Segment Search",
    "easter_eggs": [
        "Yes, just the four-digit seven-segment ones. Whole batch must have been faulty."
    ],
    "test_input_idx": 2,
    "part_1": {
        "text": "You barely reach the safety of the cave when the whale smashes into the cave mouth, collapsing it.\nSensors indicate another exit to this cave at a much greater depth, so you have no choice but to press on.\n\nAs your submarine slowly makes its way through the cave system, you notice that the four-digit seven-segment displays in your submarine are malfunctioning; they must have been damaged during the escape.\nYou'll be in a lot of trouble without them, so you'd better figure out what's wrong.\n\nEach digit of a seven-segment display is rendered by turning on or off any of seven segments named a through g:\n\n0:      1:      2:      3:      4:\n aaaa    ....\n   aaaa    aaaa    ....\nb    c  .\n   c  .\n   c  .\n   c  b    c\nb    c  .\n   c  .\n   c  .\n   c  b    c\n ....\n   ....\n   dddd    dddd    dddd\ne    f  .\n   f  e    .\n .\n   f  .\n   f\ne    f  .\n   f  e    .\n .\n   f  .\n   f\n gggg    ....\n   gggg    gggg    ....\n\n  5:      6:      7:      8:      9:\n aaaa    aaaa    aaaa    aaaa    aaaa\nb    .\n b    .\n .\n   c  b    c  b    c\nb    .\n b    .\n .\n   c  b    c  b    c\n dddd    dddd    ....\n   dddd    dddd\n.\n   f  e    f  .\n   f  e    f  .\n   f\n.\n   f  e    f  .\n   f  e    f  .\n   f\n gggg    gggg    ....\n   gggg    gggg\n\nSo, to render a 1, only segments c and f would be turned on; the rest would be off.\nTo render a 7, only segments a, c, and f would be turned on.\n\nThe problem is that the signals which control the segments have been mixed up on each display.\nThe submarine is still trying to display numbers by producing output on signal wires a through g, but those wires are connected to segments randomly.\nWorse, the wire/segment connections are mixed up separately for each four-digit display! (All of the digits within a display use the same connections, though.)\n\nSo, you might know that only signal wires b and g are turned on, but that doesn't mean segments b and g are turned on: the only digit that uses two segments is 1, so it must mean segments c and f are meant to be on.\nWith just that information, you still can't tell which wire (b/g) goes to which segment (c/f).\nFor that, you'll need to collect more information.\n\nFor each display, you watch the changing signals for a while, make a note of all ten unique signal patterns you see, and then write down a single four digit output value (your puzzle input).\nUsing the signal patterns, you should be able to work out which pattern corresponds to which digit.\n\nFor example, here is what you might see in a single entry in your notes:\n\nacedgfb cdfbe gcdfa fbcad dab cefabd cdfgeb eafb cagedb ab |\ncdfeb fcadb cdfeb cdbaf\n\n(The entry is wrapped here to two lines so it fits; in your notes, it will all be on a single line.)\n\nEach entry consists of ten unique signal patterns, a | delimiter, and finally the four digit output value.\nWithin an entry, the same wire/segment connections are used (but you don't know what the connections actually are).\nThe unique signal patterns correspond to the ten different ways the submarine tries to render a digit using the current wire/segment connections.\nBecause 7 is the only digit that uses three segments, dab in the above example means that to render a 7, signal lines d, a, and b are on.\nBecause 4 is the only digit that uses four segments, eafb means that to render a 4, signal lines e, a, f, and b are on.\n\nUsing this information, you should be able to work out which combination of signal wires corresponds to each of the ten digits.\nThen, you can decode the four digit output value.\nUnfortunately, in the above example, all of the digits in the output value (cdfeb fcadb cdfeb cdbaf) use five segments and are more difficult to deduce.\n\nFor now, focus on the easy digits.\nConsider this larger example:\n\nbe cfbegad cbdgef fgaecd cgeb fdcge agebfd fecdb fabcd edb |\nfdgacbe cefdb cefbgd gcbe\nedbfga begcd cbg gc gcadebf fbgde acbgfd abcde gfcbed gfec |\nfcgedb cgb dgebacf gc\nfgaebd cg bdaec gdafb agbcfd gdcbef bgcad gfac gcb cdgabef |\ncg cg fdcagb cbg\nfbegcd cbd adcefb dageb afcb bc aefdc ecdab fgdeca fcdbega |\nefabcd cedba gadfec cb\naecbfdg fbg gf bafeg dbefa fcge gcbea fcaegb dgceab fcbdga |\ngecf egdcabf bgf bfgea\nfgeab ca afcebg bdacfeg cfaedg gcfdb baec bfadeg bafgc acf |\ngebdcfa ecba ca fadegcb\ndbcfg fgd bdegcaf fgec aegbdf ecdfab fbedc dacgb gdcebf gf |\ncefg dcbef fcge gbcadfe\nbdfegc cbegaf gecbf dfcage bdacg ed bedf ced adcbefg gebcd |\ned bcgafe cdgba cbgef\negadfb cdbfeg cegd fecab cgb gbdefca cg fgcdab egfdb bfceg |\ngbdfcae bgc cg cgb\ngcafb gcf dcaebfg ecagb gf abcdeg gaef cafbge fdbac fegbdc |\nfgae cfgab fg bagce\n\nBecause the digits 1, 4, 7, and 8 each use a unique number of segments, you should be able to tell which combinations of signals correspond to those digits.\nCounting only digits in the output values (the part after | on each line), in the above example, there are 26 instances of digits that use a unique number of segments (highlighted above).\n\nIn the output values, how many times do digits 1, 4, 7, or 8 appear?",
        "test_input": "be cfbegad cbdgef fgaecd cgeb fdcge agebfd fecdb fabcd edb |\nfdgacbe cefdb cefbgd gcbe\nedbfga begcd cbg gc gcadebf fbgde acbgfd abcde gfcbed gfec |\nfcgedb cgb dgebacf gc\nfgaebd cg bdaec gdafb agbcfd gdcbef bgcad gfac gcb cdgabef |\ncg cg fdcagb cbg\nfbegcd cbd adcefb dageb afcb bc aefdc ecdab fgdeca fcdbega |\nefabcd cedba gadfec cb\naecbfdg fbg gf bafeg dbefa fcge gcbea fcaegb dgceab fcbdga |\ngecf egdcabf bgf bfgea\nfgeab ca afcebg bdacfeg cfaedg gcfdb baec bfadeg bafgc acf |\ngebdcfa ecba ca fadegcb\ndbcfg fgd bdegcaf fgec aegbdf ecdfab fbedc dacgb gdcebf gf |\ncefg dcbef fcge gbcadfe\nbdfegc cbegaf gecbf dfcage bdacg ed bedf ced adcbefg gebcd |\ned bcgafe cdgba cbgef\negadfb cdbfeg cegd fecab cgb gbdefca cg fgcdab egfdb bfceg |\ngbdfcae bgc cg cgb\ngcafb gcf dcaebfg ecagb gf abcdeg gaef cafbge fdbac fegbdc |\nfgae cfgab fg bagce\n",
        "test_answer": 26,
        "test_answer_idx": -5,
        "answer": "303",
        "time": 0.00040300000000570435
    },
    "part_2": {
        "text": "Through a little deduction, you should now be able to determine the remaining digits.\nConsider again the first example above:\n\nacedgfb cdfbe gcdfa fbcad dab cefabd cdfgeb eafb cagedb ab |\ncdfeb fcadb cdfeb cdbaf\n\nAfter some careful analysis, the mapping between signal wires and segments only make sense in the following configuration:\n\ndddd\ne    a\ne    a\n ffff\ng    b\ng    b\n cccc\n\nSo, the unique signal patterns would correspond to the following digits:\n\nacedgfb: 8\ncdfbe: 5\ngcdfa: 2\nfbcad: 3\ndab: 7\ncefabd: 9\ncdfgeb: 6\neafb: 4\ncagedb: 0\nab: 1\n\nThen, the four digits of the output value can be decoded:\n\ncdfeb: 5\nfcadb: 3\ncdfeb: 5\ncdbaf: 3\n\nTherefore, the output value for this entry is 5353.\n\nFollowing this same process for each entry in the second, larger example above, the output value of each entry can be determined:\n\nfdgacbe cefdb cefbgd gcbe: 8394\nfcgedb cgb dgebacf gc: 9781\ncg cg fdcagb cbg: 1197\nefabcd cedba gadfec cb: 9361\ngecf egdcabf bgf bfgea: 4873\ngebdcfa ecba ca fadegcb: 8418\ncefg dcbef fcge gbcadfe: 4548\ned bcgafe cdgba cbgef: 1625\ngbdfcae bgc cg cgb: 8717\nfgae cfgab fg bagce: 4315\n\nAdding all of the output values in this larger example produces 61229.\n\nFor each entry, determine all of the wire/segment connections and decode the four-digit output values.\nWhat do you get if you add up all of the output values?",
        "test_input": "be cfbegad cbdgef fgaecd cgeb fdcge agebfd fecdb fabcd edb |\nfdgacbe cefdb cefbgd gcbe\nedbfga begcd cbg gc gcadebf fbgde acbgfd abcde gfcbed gfec |\nfcgedb cgb dgebacf gc\nfgaebd cg bdaec gdafb agbcfd gdcbef bgcad gfac gcb cdgabef |\ncg cg fdcagb cbg\nfbegcd cbd adcefb dageb afcb bc aefdc ecdab fgdeca fcdbega |\nefabcd cedba gadfec cb\naecbfdg fbg gf bafeg dbefa fcge gcbea fcaegb dgceab fcbdga |\ngecf egdcabf bgf bfgea\nfgeab ca afcebg bdacfeg cfaedg gcfdb baec bfadeg bafgc acf |\ngebdcfa ecba ca fadegcb\ndbcfg fgd bdegcaf fgec aegbdf ecdfab fbedc dacgb gdcebf gf |\ncefg dcbef fcge gbcadfe\nbdfegc cbegaf gecbf dfcage bdacg ed bedf ced adcbefg gebcd |\ned bcgafe cdgba cbgef\negadfb cdbfeg cegd fecab cgb gbdefca cg fgcdab egfdb bfceg |\ngbdfcae bgc cg cgb\ngcafb gcf dcaebfg ecagb gf abcdeg gaef cafbge fdbac fegbdc |\nfgae cfgab fg bagce\n",
        "test_answer": 61229,
        "test_answer_idx": -1,
        "answer": "961734",
        "time": 0.007065900000270631
    }
}
