{
    "title": "Day 2: Cube Conundrum",
    "easter_eggs": [
        "No, the Elf's name is not 'WOPR'. It's Joshua."
    ],
    "test_input_idx": 0,
    "part_1": {
        "text": "You're launched high into the atmosphere! The apex of your trajectory just barely reaches the surface of a large island floating in the sky.\nYou gently land in a fluffy pile of leaves.\nIt's quite cold, but you don't see much snow.\nAn Elf runs over to greet you.\n\nThe Elf explains that you've arrived at Snow Island and apologizes for the lack of snow.\nHe'll be happy to explain the situation, but it's a bit of a walk, so you have some time.\nThey don't get many visitors up here; would you like to play a game in the meantime?\n\nAs you walk, the Elf shows you a small bag and some cubes which are either red, green, or blue.\nEach time you play this game, he will hide a secret number of cubes of each color in the bag, and your goal is to figure out information about the number of cubes.\n\nTo get information, once a bag has been loaded with cubes, the Elf will reach into the bag, grab a handful of random cubes, show them to you, and then put them back in the bag.\nHe'll do this a few times per game.\n\nYou play several games and record the information from each game (your puzzle input).\nEach game is listed with its ID number (like the 11 in Game 11: ...) followed by a semicolon-separated list of subsets of cubes that were revealed from the bag (like 3 red, 5 green, 4 blue).\n\nFor example, the record of a few games might look like this:\n\nGame 1: 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green\nGame 2: 1 blue, 2 green; 3 green, 4 blue, 1 red; 1 green, 1 blue\nGame 3: 8 green, 6 blue, 20 red; 5 blue, 4 red, 13 green; 5 green, 1 red\nGame 4: 1 green, 3 red, 6 blue; 3 green, 6 red; 3 green, 15 blue, 14 red\nGame 5: 6 red, 1 blue, 3 green; 2 blue, 1 red, 2 green\n\nIn game 1, three sets of cubes are revealed from the bag (and then put back again).\nThe first set is 3 blue cubes and 4 red cubes; the second set is 1 red cube, 2 green cubes, and 6 blue cubes; the third set is only 2 green cubes.\n\nThe Elf would first like to know which games would have been possible if the bag contained only 12 red cubes, 13 green cubes, and 14 blue cubes?\n\nIn the example above, games 1, 2, and 5 would have been possible if the bag had been loaded with that configuration.\nHowever, game 3 would have been impossible because at one point the Elf showed you 20 red cubes at once; similarly, game 4 would also have been impossible because the Elf showed you 15 blue cubes at once.\nIf you add up the IDs of the games that would have been possible, you get 8.\n\nDetermine which games would have been possible if the bag had been loaded with only 12 red cubes, 13 green cubes, and 14 blue cubes.\nWhat is the sum of the IDs of those games?",
        "test_input": "Game 1: 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green\nGame 2: 1 blue, 2 green; 3 green, 4 blue, 1 red; 1 green, 1 blue\nGame 3: 8 green, 6 blue, 20 red; 5 blue, 4 red, 13 green; 5 green, 1 red\nGame 4: 1 green, 3 red, 6 blue; 3 green, 6 red; 3 green, 15 blue, 14 red\nGame 5: 6 red, 1 blue, 3 green; 2 blue, 1 red, 2 green\n",
        "test_answer": 8,
        "test_answer_idx": -1,
        "answer": "2551",
        "time": 0.0007461000000148488
    },
    "part_2": {
        "text": "The Elf says they've stopped producing snow because they aren't getting any water! He isn't sure why the water stopped; however, he can show you how to get to the water source to check it out for yourself.\nIt's just up ahead!\n\nAs you continue your walk, the Elf poses a second question: in each game you played, what is the fewest number of cubes of each color that could have been in the bag to make the game possible?\n\nAgain consider the example games from earlier:\n\nGame 1: 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green\nGame 2: 1 blue, 2 green; 3 green, 4 blue, 1 red; 1 green, 1 blue\nGame 3: 8 green, 6 blue, 20 red; 5 blue, 4 red, 13 green; 5 green, 1 red\nGame 4: 1 green, 3 red, 6 blue; 3 green, 6 red; 3 green, 15 blue, 14 red\nGame 5: 6 red, 1 blue, 3 green; 2 blue, 1 red, 2 green\n\nIn game 1, the game could have been played with as few as 4 red, 2 green, and 6 blue cubes.\nIf any color had even one fewer cube, the game would have been impossible.\nGame 2 could have been played with a minimum of 1 red, 3 green, and 4 blue cubes.\nGame 3 must have been played with at least 20 red, 13 green, and 6 blue cubes.\nGame 4 required at least 14 red, 3 green, and 15 blue cubes.\nGame 5 needed no fewer than 6 red, 3 green, and 2 blue cubes in the bag.\n\nThe power of a set of cubes is equal to the numbers of red, green, and blue cubes multiplied together.\nThe power of the minimum set of cubes in game 1 is 48.\nIn games 2-5 it was 12, 1560, 630, and 36, respectively.\nAdding up these five powers produces the sum 2286.\n\nFor each game, find the minimum set of cubes that must have been present.\nWhat is the sum of the power of these sets?",
        "test_input": "Game 1: 3 blue, 4 red; 1 red, 2 green, 6 blue; 2 green\nGame 2: 1 blue, 2 green; 3 green, 4 blue, 1 red; 1 green, 1 blue\nGame 3: 8 green, 6 blue, 20 red; 5 blue, 4 red, 13 green; 5 green, 1 red\nGame 4: 1 green, 3 red, 6 blue; 3 green, 6 red; 3 green, 15 blue, 14 red\nGame 5: 6 red, 1 blue, 3 green; 2 blue, 1 red, 2 green\n",
        "test_answer": 2286,
        "test_answer_idx": -1,
        "answer": "62811",
        "time": 0.0021077999999761232
    }
}
