{
    "title": "Day 22: Monkey Map",
    "easter_eggs": [
        "Or \"anticlockwise\", if you're anti-counterclockwise."
    ],
    "test_input_idx": 0,
    "part_1": {
        "text": "The monkeys take you on a surprisingly easy trail through the jungle.\nThey're even going in roughly the right direction according to your handheld device's Grove Positioning System.\n\nAs you walk, the monkeys explain that the grove is protected by a force field.\nTo pass through the force field, you have to enter a password; doing so involves tracing a specific path on a strangely-shaped board.\n\nAt least, you're pretty sure that's what you have to do; the elephants aren't exactly fluent in monkey.\n\nThe monkeys give you notes that they took when they last saw the password entered (your puzzle input).\n\nFor example:\n\n...#\n        .#..\n        #...\n        ....\n...#.......#\n........#...\n..#....#....\n..........#.\n        ...#....\n        .....#..\n        .#......\n        ......#.\n\n10R5L5R10L4R5L5\n\nThe first half of the monkeys' notes is a map of the board.\nIt is comprised of a set of open tiles (on which you can move, drawn .) and solid walls (tiles which you cannot enter, drawn #).\n\nThe second half is a description of the path you must follow.\nIt consists of alternating numbers and letters:\n\nA number indicates the number of tiles to move in the direction you are facing.\nIf you run into a wall, you stop moving forward and continue with the next instruction.\nA letter indicates whether to turn 90 degrees clockwise (R) or counterclockwise (L).\nTurning happens in-place; it does not change your current tile.\n\nSo, a path like 10R5 means \"go forward 10 tiles, then turn clockwise 90 degrees, then go forward 5 tiles\".\n\nYou begin the path in the leftmost open tile of the top row of tiles.\nInitially, you are facing to the right (from the perspective of how the map is drawn).\n\nIf a movement instruction would take you off of the map, you wrap around to the other side of the board.\nIn other words, if your next tile is off of the board, you should instead look in the direction opposite of your current facing as far as you can until you find the opposite edge of the board, then reappear there.\n\nFor example, if you are at A and facing to the right, the tile in front of you is marked B; if you are at C and facing down, the tile in front of you is marked D:\n\n...#\n        .#..\n        #...\n        ....\n...#.D.....#\n........#...\nB.#....#...A\n.....C....#.\n        ...#....\n        .....#..\n        .#......\n        ......#.\n\nIt is possible for the next tile (after wrapping around) to be a wall; this still counts as there being a wall in front of you, and so movement stops before you actually wrap to the other side of the board.\n\nBy drawing the last facing you had with an arrow on each tile you visit, the full path taken by the above example looks like this:\n\n>>v#    \n        .#v.\n   \n        #.v.\n   \n        ..v.\n   \n...#...v..v#    \n>>>v...>#.>>    \n..#v...#....\n   \n...>>>>v..#.\n   \n        ...#....\n        .....#..\n        .#......\n        ......#.\n\nTo finish providing the password to this strange input device, you need to determine numbers for your final row, column, and facing as your final position appears from the perspective of the original map.\nRows start from 1 at the top and count downward; columns start from 1 at the left and count rightward.\n(In the above example, row 1, column 1 refers to the empty space with no tile on it in the top-left corner.) Facing is 0 for right (>), 1 for down (v), 2 for left (<), and 3 for up (^).\nThe final password is the sum of 1000 times the row, 4 times the column, and the facing.\n\nIn the above example, the final row is 6, the final column is 8, and the final facing is 0.\nSo, the final password is 1000 * 6 + 4 * 8 + 0: 6032.\n\nFollow the path given in the monkeys' notes.\nWhat is the final password?",
        "test_input": "        ...#\n        .#..\n        #...\n        ....\n...#.......#\n........#...\n..#....#....\n..........#.\n        ...#....\n        .....#..\n        .#......\n        ......#.\n\n10R5L5R10L4R5L5\n",
        "test_answer": 6032,
        "test_answer_idx": -1,
        "answer": "75388",
        "time": 0.3762711000163108
    },
    "part_2": {
        "text": "As you reach the force field, you think you hear some Elves in the distance.\nPerhaps they've already arrived?\n\nYou approach the strange input device, but it isn't quite what the monkeys drew in their notes.\nInstead, you are met with a large cube; each of its six faces is a square of 50x50 tiles.\n\nTo be fair, the monkeys' map does have six 50x50 regions on it.\nIf you were to carefully fold the map, you should be able to shape it into a cube!\n\nIn the example above, the six (smaller, 4x4) faces of the cube are:\n\n1111\n        1111\n        1111\n        1111\n222233334444\n222233334444\n222233334444\n222233334444\n        55556666\n        55556666\n        55556666\n        55556666\n\nYou still start in the same position and with the same facing as before, but the wrapping rules are different.\nNow, if you would walk off the board, you instead proceed around the cube.\nFrom the perspective of the map, this can look a little strange.\nIn the above example, if you are at A and move to the right, you would arrive at B facing down; if you are at C and move down, you would arrive at D facing up:\n\n...#\n        .#..\n        #...\n        ....\n...#.......#\n........#..A\n..#....#....\n.D........#.\n        ...#..B.\n        .....#..\n        .#......\n        ..C...#.\n\nWalls still block your path, even if they are on a different face of the cube.\nIf you are at E facing up, your movement is blocked by the wall marked by the arrow:\n\n...#\n        .#..\n     -->#...\n        ....\n...#..E....#\n........#...\n..#....#....\n..........#.\n        ...#....\n        .....#..\n        .#......\n        ......#.\n\nUsing the same method of drawing the last facing you had with an arrow on each tile you visit, the full path taken by the above example now looks like this:\n\n>>v#    \n        .#v.\n   \n        #.v.\n   \n        ..v.\n   \n...#..^...v#    \n.>>>>>^.#.>>    \n.^#....#....\n   \n.^........#.\n   \n        ...#..v.\n        .....#v.\n        .#v<<<<.\n        ..v...#.\n\nThe final password is still calculated from your final position and facing from the perspective of the map.\nIn this example, the final row is 5, the final column is 7, and the final facing is 3, so the final password is 1000 * 5 + 4 * 7 + 3 = 5031.\n\nFold the map into a cube, then follow the path given in the monkeys' notes.\nWhat is the final password?",
        "test_input": "        ...#\n        .#..\n        #...\n        ....\n...#.......#\n........#...\n..#....#....\n..........#.\n        ...#....\n        .....#..\n        .#......\n        ......#.\n\n10R5L5R10L4R5L5\n",
        "test_answer": 5031,
        "test_answer_idx": -1,
        "answer": null
    }
}
