{
    "title": "Day 23: Unstable Diffusion",
    "easter_eggs": [
        "Arbitrary Rectangles is my Piet Mondrian cover band."
    ],
    "test_input_idx": -8,
    "part_1": {
        "text": "You enter a large crater of gray dirt where the grove is supposed to be.\nAll around you, plants you imagine were expected to be full of fruit are instead withered and broken.\nA large group of Elves has formed in the middle of the grove.\n\n\"...but this volcano has been dormant for months.\nWithout ash, the fruit can't grow!\"\n\nYou look up to see a massive, snow-capped mountain towering above you.\n\n\"It's not like there are other active volcanoes here; we've looked everywhere.\"\n\n\"But our scanners show active magma flows; clearly it's going somewhere.\"\n\nThey finally notice you at the edge of the grove, your pack almost overflowing from the random star fruit you've been collecting.\nBehind you, elephants and monkeys explore the grove, looking concerned.\nThen, the Elves recognize the ash cloud slowly spreading above your recent detour.\n\n\"Why do you--\" \"How is--\" \"Did you just--\"\n\nBefore any of them can form a complete question, another Elf speaks up: \"Okay, new plan.\nWe have almost enough fruit already, and ash from the plume should spread here eventually.\nIf we quickly plant new seedlings now, we can still make it to the extraction point.\nSpread out!\"\n\nThe Elves each reach into their pack and pull out a tiny plant.\nThe plants rely on important nutrients from the ash, so they can't be planted too close together.\n\nThere isn't enough time to let the Elves figure out where to plant the seedlings themselves; you quickly scan the grove (your puzzle input) and note their positions.\n\nFor example:\n\n....#..\n..###.#\n#...#.#\n.#...##\n#.###..\n##.#.##\n.#..#..\n\nThe scan shows Elves # and empty ground .; outside your scan, more empty ground extends a long way in every direction.\nThe scan is oriented so that north is up; orthogonal directions are written N (north), S (south), W (west), and E (east), while diagonal directions are written NE, NW, SE, SW.\n\nThe Elves follow a time-consuming process to figure out where they should each go; you can speed up this process considerably.\nThe process consists of some number of rounds during which Elves alternate between considering where to move and actually moving.\n\nDuring the first half of each round, each Elf considers the eight positions adjacent to themself.\nIf no other Elves are in one of those eight positions, the Elf does not do anything during this round.\nOtherwise, the Elf looks in each of four directions in the following order and proposes moving one step in the first valid direction:\n\nIf there is no Elf in the N, NE, or NW adjacent positions, the Elf proposes moving north one step.\nIf there is no Elf in the S, SE, or SW adjacent positions, the Elf proposes moving south one step.\nIf there is no Elf in the W, NW, or SW adjacent positions, the Elf proposes moving west one step.\nIf there is no Elf in the E, NE, or SE adjacent positions, the Elf proposes moving east one step.\n\nAfter each Elf has had a chance to propose a move, the second half of the round can begin.\nSimultaneously, each Elf moves to their proposed destination tile if they were the only Elf to propose moving to that position.\nIf two or more Elves propose moving to the same position, none of those Elves move.\n\nFinally, at the end of the round, the first direction the Elves considered is moved to the end of the list of directions.\nFor example, during the second round, the Elves would try proposing a move to the south first, then west, then east, then north.\nOn the third round, the Elves would first consider west, then east, then north, then south.\n\nAs a smaller example, consider just these five Elves:\n\n.....\n..##.\n..#..\n.....\n..##.\n.....\n\nThe northernmost two Elves and southernmost two Elves all propose moving north, while the middle Elf cannot move north and proposes moving south.\nThe middle Elf proposes the same destination as the southwest Elf, so neither of them move, but the other three do:\n\n..##.\n.....\n..#..\n...#.\n..#..\n.....\n\nNext, the northernmost two Elves and the southernmost Elf all propose moving south.\nOf the remaining middle two Elves, the west one cannot move south and proposes moving west, while the east one cannot move south or west and proposes moving east.\nAll five Elves succeed in moving to their proposed positions:\n\n.....\n..##.\n.#...\n....#\n.....\n..#..\n\nFinally, the southernmost two Elves choose not to move at all.\nOf the remaining three Elves, the west one proposes moving west, the east one proposes moving east, and the middle one proposes moving north; all three succeed in moving:\n\n..#..\n....#\n#....\n....#\n.....\n..#..\n\nAt this point, no Elves need to move, and so the process ends.\n\nThe larger example above proceeds as follows:\n\n== Initial State ==\n..............\n..............\n.......#......\n.....###.#....\n...#...#.#....\n....#...##....\n...#.###......\n...##.#.##....\n....#..#......\n..............\n..............\n..............\n\n== End of Round 1 ==\n..............\n.......#......\n.....#...#....\n...#..#.#.....\n.......#..#...\n....#.#.##....\n..#..#.#......\n..#.#.#.##....\n..............\n....#..#......\n..............\n..............\n\n== End of Round 2 ==\n..............\n.......#......\n....#.....#...\n...#..#.#.....\n.......#...#..\n...#..#.#.....\n.#...#.#.#....\n..............\n..#.#.#.##....\n....#..#......\n..............\n..............\n\n== End of Round 3 ==\n..............\n.......#......\n.....#....#...\n..#..#...#....\n.......#...#..\n...#..#.#.....\n.#..#.....#...\n.......##.....\n..##.#....#...\n...#..........\n.......#......\n..............\n\n== End of Round 4 ==\n..............\n.......#......\n......#....#..\n..#...##......\n...#.....#.#..\n.........#....\n.#...###..#...\n..#......#....\n....##....#...\n....#.........\n.......#......\n..............\n\n== End of Round 5 ==\n.......#......\n..............\n..#..#.....#..\n.........#....\n......##...#..\n.#.#.####.....\n...........#..\n....##..#.....\n..#...........\n..........#...\n....#..#......\n..............\n\nAfter a few more rounds...\n\n== End of Round 10 ==\n.......#......\n...........#..\n..#.#..#......\n......#.......\n...#.....#..#.\n.#......##....\n.....##.......\n..#........#..\n....#.#..#....\n..............\n....#..#..#...\n..............\n\nTo make sure they're on the right track, the Elves like to check after round 10 that they're making good progress toward covering enough ground.\nTo do this, count the number of empty ground tiles contained by the smallest rectangle that contains every Elf.\n(The edges of the rectangle should be aligned to the N/S/E/W directions; the Elves do not have the patience to calculate arbitrary rectangles.) In the above example, that rectangle is:\n\n......#.....\n..........#.\n.#.#..#.....\n.....#......\n..#.....#..#\n#......##...\n....##......\n.#........#.\n...#.#..#...\n............\n...#..#..#..\n\nIn this region, the number of empty ground tiles is 110.\n\nSimulate the Elves' process and find the smallest rectangle that contains the Elves after 10 rounds.\nHow many empty ground tiles does that rectangle contain?",
        "test_input": "....#..\n..###.#\n#...#.#\n.#...##\n#.###..\n##.#.##\n.#..#..\n",
        "test_answer": 110,
        "test_answer_idx": -1,
        "answer": "3931"
    },
    "part_2": {
        "text": "It seems you're on the right track.\nFinish simulating the process and figure out where the Elves need to go.\nHow many rounds did you save them?\n\nIn the example above, the first round where no Elf moved was round 20:\n\n.......#......\n....#......#..\n..#.....#.....\n......#.......\n...#....#.#..#\n#.............\n....#.....#...\n..#.....#.....\n....#.#....#..\n.........#....\n....#......#..\n.......#......\n\nFigure out where the Elves need to go.\nWhat is the number of the first round where no Elf moves?",
        "test_input": "....#..\n..###.#\n#...#.#\n.#...##\n#.###..\n##.#.##\n.#..#..\n",
        "test_answer": 20,
        "test_answer_idx": -2,
        "answer": "944"
    }
}
