{
    "title": "Day 24: Never Tell Me The Odds",
    "easter_eggs": [
        "What, you've never studied probably-magical physics?"
    ],
    "test_input_idx": 0,
    "part_1": {
        "text": "It seems like something is going wrong with the snow-making process.\nInstead of forming snow, the water that's been absorbed into the air seems to be forming hail!\n\nMaybe there's something you can do to break up the hailstones?\n\nDue to strong, probably-magical winds, the hailstones are all flying through the air in perfectly linear trajectories.\nYou make a note of each hailstone's position and velocity (your puzzle input).\nFor example:\n\n19, 13, 30 @ -2,  1, -2\n18, 19, 22 @ -1, -1, -2\n20, 25, 34 @ -2, -2, -4\n12, 31, 28 @ -1, -2, -1\n20, 19, 15 @  1, -5, -3\n\nEach line of text corresponds to the position and velocity of a single hailstone.\nThe positions indicate where the hailstones are right now (at time 0).\nThe velocities are constant and indicate exactly how far each hailstone will move in one nanosecond.\n\nEach line of text uses the format px py pz @ vx vy vz.\nFor instance, the hailstone specified by 20, 19, 15 @  1, -5, -3 has initial X position 20, Y position 19, Z position 15, X velocity 1, Y velocity -5, and Z velocity -3.\nAfter one nanosecond, the hailstone would be at 21, 14, 12.\n\nPerhaps you won't have to do anything.\nHow likely are the hailstones to collide with each other and smash into tiny ice crystals?\n\nTo estimate this, consider only the X and Y axes; ignore the Z axis.\nLooking forward in time, how many of the hailstones' paths will intersect within a test area? (The hailstones themselves don't have to collide, just test for intersections between the paths they will trace.)\n\nIn this example, look for intersections that happen with an X and Y position each at least 7 and at most 27; in your actual data, you'll need to check a much larger test area.\nComparing all pairs of hailstones' future paths produces the following results:\n\nHailstone A: 19, 13, 30 @ -2, 1, -2\nHailstone B: 18, 19, 22 @ -1, -1, -2\nHailstones' paths will cross inside the test area (at x=14.333, y=15.333).\n\nHailstone A: 19, 13, 30 @ -2, 1, -2\nHailstone B: 20, 25, 34 @ -2, -2, -4\nHailstones' paths will cross inside the test area (at x=11.667, y=16.667).\n\nHailstone A: 19, 13, 30 @ -2, 1, -2\nHailstone B: 12, 31, 28 @ -1, -2, -1\nHailstones' paths will cross outside the test area (at x=6.2, y=19.4).\n\nHailstone A: 19, 13, 30 @ -2, 1, -2\nHailstone B: 20, 19, 15 @ 1, -5, -3\nHailstones' paths crossed in the past for hailstone A.\n\nHailstone A: 18, 19, 22 @ -1, -1, -2\nHailstone B: 20, 25, 34 @ -2, -2, -4\nHailstones' paths are parallel; they never intersect.\n\nHailstone A: 18, 19, 22 @ -1, -1, -2\nHailstone B: 12, 31, 28 @ -1, -2, -1\nHailstones' paths will cross outside the test area (at x=-6, y=-5).\n\nHailstone A: 18, 19, 22 @ -1, -1, -2\nHailstone B: 20, 19, 15 @ 1, -5, -3\nHailstones' paths crossed in the past for both hailstones.\n\nHailstone A: 20, 25, 34 @ -2, -2, -4\nHailstone B: 12, 31, 28 @ -1, -2, -1\nHailstones' paths will cross outside the test area (at x=-2, y=3).\n\nHailstone A: 20, 25, 34 @ -2, -2, -4\nHailstone B: 20, 19, 15 @ 1, -5, -3\nHailstones' paths crossed in the past for hailstone B.\n\nHailstone A: 12, 31, 28 @ -1, -2, -1\nHailstone B: 20, 19, 15 @ 1, -5, -3\nHailstones' paths crossed in the past for both hailstones.\n\nSo, in this example, 2 hailstones' future paths cross inside the boundaries of the test area.\n\nHowever, you'll need to search a much larger test area if you want to see if any hailstones might collide.\nLook for intersections that happen with an X and Y position each at least 200000000000000 and at most 400000000000000.\nDisregard the Z axis entirely.\n\nConsidering only the X and Y axes, check all pairs of hailstones' future paths for intersections.\nHow many of these intersections occur within the test area?",
        "test_input": "19, 13, 30 @ -2,  1, -2\n18, 19, 22 @ -1, -1, -2\n20, 25, 34 @ -2, -2, -4\n12, 31, 28 @ -1, -2, -1\n20, 19, 15 @  1, -5, -3\n",
        "test_answer": 2,
        "test_answer_idx": -3,
        "answer": "14799",
        "time": 0.08711099997162819
    },
    "part_2": {
        "text": "Upon further analysis, it doesn't seem like any hailstones will naturally collide.\nIt's up to you to fix that!\n\nYou find a rock on the ground nearby.\nWhile it seems extremely unlikely, if you throw it just right, you should be able to hit every hailstone in a single throw!\n\nYou can use the probably-magical winds to reach any integer position you like and to propel the rock at any integer velocity.\nNow including the Z axis in your calculations, if you throw the rock at time 0, where do you need to be so that the rock perfectly collides with every hailstone? Due to probably-magical inertia, the rock won't slow down or change direction when it collides with a hailstone.\n\nIn the example above, you can achieve this by moving to position 24, 13, 10 and throwing the rock at velocity -3, 1, 2.\nIf you do this, you will hit every hailstone as follows:\n\nHailstone: 19, 13, 30 @ -2, 1, -2\nCollision time: 5\nCollision position: 9, 18, 20\n\nHailstone: 18, 19, 22 @ -1, -1, -2\nCollision time: 3\nCollision position: 15, 16, 16\n\nHailstone: 20, 25, 34 @ -2, -2, -4\nCollision time: 4\nCollision position: 12, 17, 18\n\nHailstone: 12, 31, 28 @ -1, -2, -1\nCollision time: 6\nCollision position: 6, 19, 22\n\nHailstone: 20, 19, 15 @ 1, -5, -3\nCollision time: 1\nCollision position: 21, 14, 12\n\nAbove, each hailstone is identified by its initial position and its velocity.\nThen, the time and position of that hailstone's collision with your rock are given.\n\nAfter 1 nanosecond, the rock has exactly the same position as one of the hailstones, obliterating it into ice dust! Another hailstone is smashed to bits two nanoseconds after that.\nAfter a total of 6 nanoseconds, all of the hailstones have been destroyed.\n\nSo, at time 0, the rock needs to be at X position 24, Y position 13, and Z position 10.\nAdding these three coordinates together produces 47.\n(Don't add any coordinates from the rock's velocity.)\n\nDetermine the exact position and velocity the rock needs to have at time 0 so that it perfectly collides with every hailstone.\nWhat do you get if you add up the X, Y, and Z coordinates of that initial position?",
        "test_input": "19, 13, 30 @ -2,  1, -2\n18, 19, 22 @ -1, -1, -2\n20, 25, 34 @ -2, -2, -4\n12, 31, 28 @ -1, -2, -1\n20, 19, 15 @  1, -5, -3\n",
        "test_answer": 47,
        "test_answer_idx": -2,
        "answer": "1007148211789625",
        "time": 0.0010066000104416162
    }
}
