{
    "title": "Day 10: Pipe Maze",
    "easter_eggs": [
        "Manufactured by Hamilton and Hilbert Pipe Company"
    ],
    "test_input_idx": -5,
    "part_1": {
        "text": "You use the hang glider to ride the hot air from Desert Island all the way up to the floating metal island.\nThis island is surprisingly cold and there definitely aren't any thermals to glide on, so you leave your hang glider behind.\n\nYou wander around for a while, but you don't find any people or animals.\nHowever, you do occasionally find signposts labeled \"Hot Springs\" pointing in a seemingly consistent direction; maybe you can find someone at the hot springs and ask them where the desert-machine parts are made.\n\nThe landscape here is alien; even the flowers and trees are made of metal.\nAs you stop to admire some metal grass, you notice something metallic scurry away in your peripheral vision and jump into a big pipe! It didn't look like any animal you've ever seen; if you want a better look, you'll need to get ahead of it.\n\nScanning the area, you discover that the entire field you're standing on is densely packed with pipes; it was hard to tell at first because they're the same metallic silver color as the \"ground\".\nYou make a quick sketch of all of the surface pipes you can see (your puzzle input).\n\nThe pipes are arranged in a two-dimensional grid of tiles:\n\n| is a vertical pipe connecting north and south.\n- is a horizontal pipe connecting east and west.\nL is a 90-degree bend connecting north and east.\nJ is a 90-degree bend connecting north and west.\n7 is a 90-degree bend connecting south and west.\nF is a 90-degree bend connecting south and east.\n.\nis ground; there is no pipe in this tile.\nS is the starting position of the animal; there is a pipe on this tile, but your sketch doesn't show what shape the pipe has.\n\nBased on the acoustics of the animal's scurrying, you're confident the pipe that contains the animal is one large, continuous loop.\n\nFor example, here is a square loop of pipe:\n\n.....\n.F-7.\n.|.|.\n.L-J.\n.....\n\nIf the animal had entered this loop in the northwest corner, the sketch would instead look like this:\n\n.....\n.S-7.\n.|.|.\n.L-J.\n.....\n\nIn the above diagram, the S tile is still a 90-degree F bend: you can tell because of how the adjacent pipes connect to it.\n\nUnfortunately, there are also many pipes that aren't connected to the loop! This sketch shows the same loop as above:\n\n-L|F7\n7S-7|\nL|7||\n-L-J|\nL|-JF\n\nIn the above diagram, you can still figure out which pipes form the main loop: they're the ones connected to S, pipes those pipes connect to, pipes those pipes connect to, and so on.\nEvery pipe in the main loop connects to its two neighbors (including S, which will have exactly two pipes connecting to it, and which is assumed to connect back to those two pipes).\n\nHere is a sketch that contains a slightly more complex main loop:\n\n..F7.\n.FJ|.\nSJ.L7\n|F--J\nLJ...\n\nHere's the same example sketch with the extra, non-main-loop pipe tiles also shown:\n\n7-F7-\n.FJ|7\nSJLL7\n|F--J\nLJ.LJ\n\nIf you want to get out ahead of the animal, you should find the tile in the loop that is farthest from the starting position.\nBecause the animal is in the pipe, it doesn't make sense to measure this by direct distance.\nInstead, you need to find the tile that would take the longest number of steps along the loop to reach from the starting point - regardless of which way around the loop the animal went.\n\nIn the first example with the square loop:\n\n.....\n.S-7.\n.|.|.\n.L-J.\n.....\n\nYou can count the distance each tile in the loop is from the starting point like this:\n\n.....\n.012.\n.1.3.\n.234.\n.....\n\nIn this example, the farthest point from the start is 4 steps away.\n\nHere's the more complex loop again:\n\n..F7.\n.FJ|.\nSJ.L7\n|F--J\nLJ...\n\nHere are the distances for each tile on that loop:\n\n..45.\n.236.\n01.78\n14567\n23...\n\nFind the single giant loop starting at S.\nHow many steps along the loop does it take to get from the starting position to the point farthest from the starting position?",
        "test_input": "7-F7-\n.FJ|7\nSJLL7\n|F--J\nLJ.LJ\n",
        "test_answer": null,
        "test_answer_idx": null,
        "answer": "7086",
        "time": 0.02830980000044292
    },
    "part_2": {
        "text": "You quickly reach the farthest point of the loop, but the animal never emerges.\nMaybe its nest is within the area enclosed by the loop?\n\nTo determine whether it's even worth taking the time to search for such a nest, you should calculate how many tiles are contained within the loop.\nFor example:\n\n...........\n.S-------7.\n.|F-----7|.\n.||.....||.\n.||.....||.\n.|L-7.F-J|.\n.|..|.|..|.\n.L--J.L--J.\n...........\n\nThe above loop encloses merely four tiles - the two pairs of .\nin the southwest and southeast (marked I below).\nThe middle .\ntiles (marked O below) are not in the loop.\nHere is the same loop again with those regions marked:\n\n...........\n.S-------7.\n.|F-----7|.\n.||OOOOO||.\n.||OOOOO||.\n.|L-7OF-J|.\n.|II|O|II|.\n.L--JOL--J.\n.....O.....\n\nIn fact, there doesn't even need to be a full tile path to the outside for tiles to count as outside the loop - squeezing between pipes is also allowed! Here, I is still within the loop and O is still outside the loop:\n\n..........\n.S------7.\n.|F----7|.\n.||OOOO||.\n.||OOOO||.\n.|L-7F-J|.\n.|II||II|.\n.L--JL--J.\n..........\n\nIn both of the above examples, 4 tiles are enclosed by the loop.\n\nHere's a larger example:\n\n.F----7F7F7F7F-7....\n.|F--7||||||||FJ....\n.||.FJ||||||||L7....\nFJL7L7LJLJ||LJ.L-7..\nL--J.L7...LJS7F-7L7.\n....F-J..F7FJ|L7L7L7\n....L7.F7||L7|.L7L7|\n.....|FJLJ|FJ|F7|.LJ\n....FJL-7.||.||||...\n....L---J.LJ.LJLJ...\n\nThe above sketch has many random bits of ground, some of which are in the loop (I) and some of which are outside it (O):\n\nOF----7F7F7F7F-7OOOO\nO|F--7||||||||FJOOOO\nO||OFJ||||||||L7OOOO\nFJL7L7LJLJ||LJIL-7OO\nL--JOL7IIILJS7F-7L7O\nOOOOF-JIIF7FJ|L7L7L7\nOOOOL7IF7||L7|IL7L7|\nOOOOO|FJLJ|FJ|F7|OLJ\nOOOOFJL-7O||O||||OOO\nOOOOL---JOLJOLJLJOOO\n\nIn this larger example, 8 tiles are enclosed by the loop.\n\nAny tile that isn't part of the main loop can count as being enclosed by the loop.\nHere's another example with many bits of junk pipe lying around that aren't connected to the main loop at all:\n\nFF7FSF7F7F7F7F7F---7\nL|LJ||||||||||||F--J\nFL-7LJLJ||||||LJL-77\nF--JF--7||LJLJ7F7FJ-\nL---JF-JLJ.||-FJLJJ7\n|F|F-JF---7F7-L7L|7|\n|FFJF7L7F-JF7|JL---7\n7-L-JL7||F7|L7F-7F7|\nL.L7LFJ|||||FJL7||LJ\nL7JLJL-JLJLJL--JLJ.L\n\nHere are just the tiles that are enclosed by the loop marked with I:\n\nFF7FSF7F7F7F7F7F---7\nL|LJ||||||||||||F--J\nFL-7LJLJ||||||LJL-77\nF--JF--7||LJLJIF7FJ-\nL---JF-JLJIIIIFJLJJ7\n|F|F-JF---7IIIL7L|7|\n|FFJF7L7F-JF7IIL---7\n7-L-JL7||F7|L7F-7F7|\nL.L7LFJ|||||FJL7||LJ\nL7JLJL-JLJLJL--JLJ.L\n\nIn this last example, 10 tiles are enclosed by the loop.\n\nFigure out whether you have time to search for the nest by calculating the area within the loop.\nHow many tiles are enclosed by the loop?",
        "test_input": "FF7FSF7F7F7F7F7F---7\nL|LJ||||||||||||F--J\nFL-7LJLJ||||||LJL-77\nF--JF--7||LJLJ7F7FJ-\nL---JF-JLJ.||-FJLJJ7\n|F|F-JF---7F7-L7L|7|\n|FFJF7L7F-JF7|JL---7\n7-L-JL7||F7|L7F-7F7|\nL.L7LFJ|||||FJL7||LJ\nL7JLJL-JLJLJL--JLJ.L\n",
        "test_answer": 10,
        "test_answer_idx": -1,
        "answer": "317",
        "time": 0.11149280000017825
    }
}
